app/controllers/pages_controller.rb

SELECT "properties".* FROM "properties"
---
  def search
    @properties = Property.all