app/controllers/properties_controller.rb

SELECT "properties".* FROM "properties" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "properties"
SELECT "properties".* FROM "properties" WHERE "properties"."number_of_rooms" = ? LIMIT ? OFFSET ?  [["number_of_rooms", 2], ["LIMIT", 30], ["OFFSET", 0]]
---
  def index
    @properties = Property.all.paginate(page: params[:page], per_page: 30)
    @properties = @properties.where(title: params["title"]) if params["title"].present?
    @properties = @properties.where(price: params["price"]) if params["price"].present?
    @properties = @properties.where(address: params["address"]) if params["address"].present?
    @properties = @properties.where(number_of_rooms: params["number_of_rooms"]) if params["number_of_rooms"].present?

INSERT INTO "properties" ("image", "title", "price", "address", "number_of_rooms", "MRT", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @property = Property.new(property_params)

    respond_to do |format|
      if @property.save